stories/notes/cuda.org
#+BEGIN_COMMENT
.. title: CUDA Notes
.. slug: cuda
.. date: 11/01/2014
.. tags: 
.. link: linux, cuda, parallel processing
.. description: Notes on NVIDIA's CUDA
.. type: text
#+END_COMMENT
#+OPTIONS: toc:nil num:t ^:nil
#+TOC: headlines 3

* Pre-installation of CUDA software

** Check for a CUDA-enabled card
   /Sources/
   1. http://docs.nvidia.com/cuda/cuda-getting-started-guide-for-linux/#axzz3qFKp3T3Z
   2. https://developer.nvidia.com/cuda-gpus

   To check for a CUDA card in Linux, use the command:

   #+BEGIN_SRC sh
lspci | grep -i nvidia
   #+END_SRC

   On my laptop, I get the following output:

   #+BEGIN_SRC sh
01:00.0 VGA compatible controller: NVIDIA Corporation GF108M [GeForce GT 555M] (rev a1)
   #+END_SRC

   I checked that the GeForce GT 555m was CUDA-capable at NVIDIA's
   website listing all CUDA GPU's (see link above). While it's
   certainly not a new GPU card, it is CUDA-enabled with Compute
   Capability 2.1.

-----

* Installation of the CUDA Development Kit on Debian

** Installation of the CUDA driver
   /Sources/
   1. https://wiki.debian.org/NvidiaGraphicsDrivers
   2. https://wiki.debian.org/NvidiaGraphicsDrivers#configure
   3. http://linuxconfig.org/nvidia-geforce-driver-installation-on-debian-jessie-linux-8-64bit
   4. https://packages.debian.org/jessie/devel/nvidia-cuda-toolkit

   I mostly followed the directions at the first link above. I
   noticed, however, that the main lines did nothing on my system,
   even when I had sources.list properly configured:

#+BEGIN_SRC sh
aptitude update
aptitude -r install linux-headers-$(uname -r|sed 's,[^-]*-[^-]*-,,') nvidia-kernel-dkms
#+END_SRC

   I tried next to install the package *nvidia-driver* through
   apt-get, but unmet dependencies raised a few errors during its
   installation, many concerning Xorg. So, I thought perhaps the
   *nvidia-xconfig* package was first required (see the second link
   above). I tried installing it using *sudo apt-get install
   nvidia-xconfig*, but the installation hung.

   I next rebooted my computer and fixed apt-get by running

#+BEGIN_SRC sh
sudo dpkg --configure -a
#+END_SRC

   Fortunately, *nvidia-driver* and everything else installed
   correctly at this point. I suppose the moral of the story is to
   keep trying until *nvidia-driver* installs.

   Next, I needed to create the Xorg configuration file. This is
   easily done using *nvidia-xconfig*. Simply type *sudo
   nvidia-xconfig* and the configuration file is generated in
   =/etc/X11/xorg.conf=. Restart the computer and run
   *nvidia-settings* to verify whether you have the Nvidia driver
   working.

-----

** Installation using a stand-alone install
   /Sources/
   1. https://www.quantstart.com/articles/Installing-Nvidia-cuda-on-Ubuntu-14-04-for-Linux-GPU-Computing

   I have not yet tried the stand-alone install, though I did find
   rather good notes on doing it in Ubuntu 14.04 at the link above.
